OpenNuvoton/M480BSP/SampleCode/StdDriver/HSUSBD_Mass_Storage_SD/MassStorage.c
    /* For MSC compliance test, if received an invalid command should stall it */
    while(1)
    {
        if (HSUSBD->EP[EPA].EPINTSTS & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
        {
            if (g_u32HsEpStallLock & 0x1)
                HSUSBD_SetEpStall(EPA);
            if (g_u32HsEpStallLock & 0x2)
                HSUSBD_SetEpStall(EPB);
            break;
        }
        else
        {
            if ((HSUSBD_GetEpStall(EPA) == 0) && (!(HSUSBD->EP[EPA].EPINTSTS & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)))
                HSUSBD->EP[EPA].EPRSPCTL = (HSUSBD->EP[EPA].EPRSPCTL & 0x10) | HSUSBD_EP_RSPCTL_SHORTTXEN;
        }
    }
}

void MSC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk|HSUSBD_BUSINTEN_RESUMEIEN_Msk|HSUSBD_BUSINTEN_SUSPENDIEN_Msk|HSUSBD_BUSINTEN_RSTIEN_Msk|HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(u32Len);
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();
    while(g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone)
            break;

        if (!HSUSBD_IS_ATTACHED())
            break;
    }
}

void MSC_AckCmd()
{
    g_sCSW.bCSWStatus = g_u8Prevent;
    if (SD0.IsCardInsert == 0)
    {
        if ((g_sCBW.u8OPCode == UFI_INQUIRY) || (g_sCBW.u8OPCode == UFI_REQUEST_SENSE))
            g_sCSW.bCSWStatus = 0x00;
        else
            g_sCSW.bCSWStatus = 0x01;
    }
    HSUSBD_MemCopy((uint8_t *)g_u32MassBase, (uint8_t *)&g_sCSW.dCSWSignature, 16);
    MSC_BulkIn(g_u32MassBase, 13);
    g_u8BulkState = BULK_CBW;
    g_u8MscOutPacket = 0;
}

void MSC_ReadMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SDH_Read(SDH0, buffer, addr, size);
}

void MSC_WriteMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SDH_Write(SDH0, buffer, addr, size);
}

